Комплексная_автоматизация_2_МОМ_2019.Patch2/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.СтатусыРеализацийТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеализацияПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СделкиСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>КартаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.КартыЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВернутьМногооборотнуюТару</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозвратаМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗалогЗаТару</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОформленияПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.ВариантыОформленияПродажи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.КлассификаторТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Комплексная_автоматизация_2_МОМ_2019.Patch2/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Комплексная_автоматизация_2_МОМ_2019.Patch2/src/Documents/РеализацияТоваровУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура bt_Patch2ПриОткрытииПосле(Отказ)
	
	ИзменитьДоступностьКнопокПечатиКомплектов();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДоступностьКнопокПечатиКомплектов()
	
	Если Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС") Тогда
		
		КоманднаяПанель.ПодчиненныеЭлементы.ПодменюПечать.ПодчиненныеЭлементы
		.ПодменюПечатьОбычное.ПодчиненныеЭлементы.ПодменюПечатьОбычное_4.Доступность = Ложь;   //ип
		
		КоманднаяПанель.ПодчиненныеЭлементы.ПодменюПечать.ПодчиненныеЭлементы
		.ПодменюПечатьОбычное.ПодчиненныеЭлементы.ПодменюПечатьОбычное_5.Доступность = Истина;
		
	Иначе 
		КоманднаяПанель.ПодчиненныеЭлементы.ПодменюПечать.ПодчиненныеЭлементы
		.ПодменюПечатьОбычное.ПодчиненныеЭлементы.ПодменюПечатьОбычное_4.Доступность = Истина;   //ип
		
		КоманднаяПанель.ПодчиненныеЭлементы.ПодменюПечать.ПодчиненныеЭлементы
		.ПодменюПечатьОбычное.ПодчиненныеЭлементы.ПодменюПечатьОбычное_5.Доступность = Ложь;
		
	КонецЕсли;
	

КонецПроцедуры // ИхменитьДоступностьКнопокПечатиКомплектов()

&НаКлиенте
Процедура bt_Patch2ПартнерБезКЛПриИзмененииПосле(Элемент)
	
	ИзменитьДоступностьКнопокПечатиКомплектов();
	bt_Patch2РассчитатьИОборазитьДолгКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура bt_Patch2ОрганизацияПриИзмененииПосле(Элемент)
	
	ИзменитьДоступностьКнопокПечатиКомплектов();
	bt_Patch2РассчитатьИОборазитьДолгКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура bt_Patch2ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	ИзменитьДоступностьКнопокПечатиКомплектов();
	
КонецПроцедуры


&НаСервере
Процедура bt_Patch2ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Долг = 0;
	
	bt_Patch2ПартнерПриИзмененииПослеНаСервере(Объект.Партнер, Объект.Организация, Долг);
	
	Если Долг > 0 Тогда
		
		Элементы.Декорация5.Заголовок = "Нам должны " + Долг;
		Элементы.Декорация5.Видимость = Истина;
		Элементы.Декорация5.ЦветТекста = WebЦвета.Красный;
		
	ИначеЕсли Долг < 0 Тогда
		
		Элементы.Декорация5.Заголовок = "Мы должны " + Долг;
		Элементы.Декорация5.Видимость = Истина;
		Элементы.Декорация5.ЦветТекста = WebЦвета.Зеленый;
		
	ИНаче
		
		Элементы.Декорация5.Заголовок = "Нет задолженностей";
		Элементы.Декорация5.Видимость = Истина;
		Элементы.Декорация5.ЦветТекста = WebЦвета.Синий;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда
	
		Объект.Дата = ТекущаяДата() + 86400;
		
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура bt_Patch2ПартнерПриИзмененииПосле(Элемент)
	bt_Patch2РассчитатьИОборазитьДолгКлиента();
КонецПроцедуры

&НаКлиенте
Процедура bt_Patch2КонтрагентПриИзмененииПосле(Элемент)
	bt_Patch2РассчитатьИОборазитьДолгКлиента();
КонецПроцедуры

&НаКлиенте
Процедура bt_Patch2Декорация5НажатиеПосле(Элемент)
	bt_Patch2РассчитатьИОборазитьДолгКлиента();
КонецПроцедуры


&НаСервереБезКонтекста
Процедура bt_Patch2ПартнерПриИзмененииПослеНаСервере(Партнер, Организация, Долг)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики
	|ПОМЕСТИТЬ ВТКлючиАналитики
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|ГДЕ
	|	АналитикаУчетаПоПартнерам.Партнер = &Партнер
	|	И АналитикаУчетаПоПартнерам.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(РасчетыСКлиентамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(
	|			,
	|			АналитикаУчетаПоПартнерам В
	|				(ВЫБРАТЬ
	|					ВТКлючиАналитики.КлючАналитики КАК КлючАналитики
	|				ИЗ
	|					ВТКлючиАналитики КАК ВТКлючиАналитики)) КАК РасчетыСКлиентамиОстатки";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Долг = ВыборкаДетальныеЗаписи.СуммаОстаток;
		
	КонецЦикла;
	
КонецПроцедуры



&НаКлиенте
Процедура bt_Patch2РассчитатьИОборазитьДолгКлиента()
	
	Долг = 0;

	bt_Patch2ПартнерПриИзмененииПослеНаСервере(Объект.Партнер, Объект.Организация, Долг);
	
	Если Долг > 0 Тогда
		
		Элементы.Декорация5.Заголовок = "Нам должны " + Долг;
		Элементы.Декорация5.Видимость = Истина;
		Элементы.Декорация5.ЦветТекста = WebЦвета.Красный;
		
	ИначеЕсли Долг < 0 Тогда
		
		Элементы.Декорация5.Заголовок = "Мы должны " + Долг;
		Элементы.Декорация5.Видимость = Истина;
		Элементы.Декорация5.ЦветТекста = WebЦвета.Зеленый;
		
	ИНаче
		
		Элементы.Декорация5.Заголовок = "Нет задолженностей";
		Элементы.Декорация5.Видимость = Истина;
		Элементы.Декорация5.ЦветТекста = WebЦвета.Синий;
		
		
	КонецЕсли;
	
	
КонецПроцедуры
